package simulation.action;

import simulation.map.WorldMap;

public class EndGame {
    /*
    - Запрашиваем у карты всех существ
    - Проверяем что ест существо
    - Запрашиваем у карты есть ли еда для этого существа
    - Нужно как то проверить есть ли доступ у животного к еде ( возможно в методе где все существа двигаются нужно
    использовать флаги, метод поиска еды будет булиан и будет возвращать тру или фолс если нашел еду или нет
    - Переименовать класс это должна быть какая то утилита которая просто проверяет а не заканчивает игру
    -
     */

    public void getCreature(){


    }
}
